Revit 2027 API
ParameterTypeId.ViewSolarstudyLightingAzimuthText Property
 "Lighting azimuth text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyLightingAzimuthText { get; }
Public Shared ReadOnly Property ViewSolarstudyLightingAzimuthText As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyLightingAzimuthText {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyLightingAzimuthText : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace